var gradeInfoCodeMap=[
    {
      name: '小学三\\五年级',
      subject: [
        {
          name: '数学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.计算',
                '2.数一数'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.计算',
                '2.数一数',
                '3.几何'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.计算',
                '2.应用题',
                '3.数一数'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.计算',
                '2.图形',
                '3.数学好玩综合题',
                '4.奇妙的数字'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.应用题',
                '2.数一数',
                '3.图形',
                '4.数学好玩综合题',
                '5.奇妙的数字'
              ]
            }
          ]
        },
        {
          name: '语文',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.近义词/反义词/成语笔顺、间架结构',
                '2.默写名句名篇'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.阅读同步练习单元重点解读',
                '2.理解重要词、句、概念的含义'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.学习写作方法进行素材积累',
                '2.筛选整合信息，归纳主题思想',
                '3.分析文章结构，作者情感态度、观点看法',
                '4.体会文体特征、表现手法、语言特色'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.多音字、关联词、成语俗语等',
                '2.各类主题作文写作表达通顺',
                '3.体会语句丰富含义，品味语言',
                '4.鉴赏文学形象，评价作品情感价值'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.各类应用文写作熟悉格式',
                '2.正确使用词语和句子',
                '3.语言表达连贯得体、鲜明生动，能写叙述类文章'
              ]
            }
          ]
        },
        {
          name: '英语',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.自然拼读基础词汇句型',
                '2.见词能拼绘本培养阅读 '
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.建立信心培养习惯开口说，随心听',
                '2.基础信息交互问答',
                '3.拼读拼写，分级阅读习惯培养'
              ]
            },
            {
              name: 'LV3 70-90分',
              txt: [
                '1.同步校内原版教材补充',
                '2.篇章记叙文阅读图文描述',
                '3.能听懂生活场景信息告示等，进行描述类段落陈述'
              ]
            },
            {
              name: 'LV4 90-100分',
              txt: [
                '1.基础知识学习语言技能强化',
                '2.所学知识四项技能全面应用，逐渐培养逻辑习惯',
                '3.可听懂不同类信息的广告、指示、态度及意愿'
              ]
            }
          ]
        }
      ]
    },
    {
      name: '六年级',
      subject: [
        {
          name: '数学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.能够根据法则和运算律正确地进行运算',
                '2.熟练使用常用速算方法'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.能够模仿例题的解题方法对类似题目作出正确的解题'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.能够根据已知条件推理出隐藏条件',
                '2.可以把各专题知识点结合应用',
                '3.对数字性质综合有独到见解'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.能够根据问题背景，运用所学知识、思想方法，获取有效信息',
                '2.能够选择恰当的方法，形成解决问题的思路',
                '3.能够运用数学语言表述解决问题的过程'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.通过阅读材料获取新知识与新方法',
                '2.从新情景中发现问题，将问题简化',
                '3.合理运用专题知识，解决对应专题方法'
              ]
            }
          ]
        },
        {
          name: '语文',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.理解重要词、句、概念的含义'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.筛选整合信息，归纳主题思想',
                '2.分析文章结构，作者情感态度、观点看法'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.体会语句丰富含义，品味语言',
                '2.鉴赏文学形象，评价作品情感价值',
                '3.阅读题型训练难点巩固'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.正确使用词语和句子',
                '2.语言表达连贯得体、鲜明生动，能写叙述类文章',
                '3.各类应用文写作熟悉格式'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.多角度发掘作品主题及内涵',
                '2.探讨作者写作意图，探究问题并提出',
                '3.模拟考场作文学会迁移运用'
              ]
            }
          ]
        },
        {
          name: '英语',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.能听懂常规指令要求，简短叙事',
                '2.基础信息交互问答'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.能听懂生活场景信息告示等，进行描述类段落陈述',
                '2.所学知识四项技能全面应用，逐渐培养逻辑习惯'
              ]
            },
            {
              name: 'LV3 70-90分',
              txt: [
                '1.可听懂不同类信息的广告指示态度及意愿',
                '2.可接受询问并提出问题，获取或表达意见，交互讨论',
                '3.与原版书籍做阅读衔接科技实事新闻类题材巩固'
              ]
            },
            {
              name: 'LV4 90-100分',
              txt: [
                '1.能够在相当广泛的主题内进行交谈讨论',
                '2.向学术探究阅读方向转换',
                '3.可书写事实性报告，进行评估并提出建议',
                '4.学术英语过渡培养批判性思维训练语言的精准性与缜密度'
              ]
            }
          ]
        }
      ]
    },
    {
      name: '初一\\初二',
      subject: [
        {
          name: '数学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.整式的加减',
                '2.一元一次方程',
                '3.几何图形初步'
              ]
            },
            {
              name: 'LV2 60-72分',
              txt: [
                '1.相交线与平行线',
                '2.实数知识点的掌握',
                '3.二元一次方程组'
              ]
            },
            {
              name: 'LV3 72-90分',
              txt: [
                '1.平面直角坐标系',
                '2.不等式与不等式组',
                '3.数据的收集',
                '4.整理与描述',
                '5.三角形'
              ]
            },
            {
              name: 'LV4 90-110分',
              txt: [
                '1.全等三角形辅助线',
                '2.全等三角形',
                '3.轴对称',
                '4.因式分解',
                '5.整式乘除',
                '6.分式'
              ]
            },
            {
              name: 'LV5 110-120分',
              txt: [
                '1.平行四边形',
                '2.	二次根式',
                '3.	勾股数',
                '4.	一次函数',
                '5.	数据的分析'
              ]
            }
          ]
        },
        {
          name: '语文',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.小初作文对比分析',
                '2.小初阅读比较与衔接名著阅读'
              ]
            },
            {
              name: 'LV2 60-72分',
              txt: [
                '1.品味文章语言把握文章内容',
                '2.病句、语句衔接',
                '3.叙事作文写作作文素材积累'
              ]
            },
            {
              name: 'LV3 72-90分',
              txt: [
                '1.选好作文素材学会议论抒情',
                '2.把握文章重点、体悟关键语句、深层理解情感'
              ]
            },
            {
              name: 'LV4 90-110分',
              txt: [
                '1.人物描写、环境描写、场面描写',
                '2.非连续性文本信息提取、记叙文阅读题型梳理',
                '3.重点古诗文篇目背默、文学文化常识积累',
                '4.作文素材积累和升格想象作文写作'
              ]
            },
            {
              name: 'LV5 110-120分',
              txt: [
                '1.小说与散文阅读题型',
                '2.口语交际、语言得体、谦辞敬语',
                '3.不同类型作文的写作、作文的扩写、改写和缩写',
                '4.阅读现代文，感受作者情感、阅读文言文，体会作者情趣',
                '5.基础知识综合运用、课内字词、文常基础'
              ]
            }
          ]
        },
        {
          name: '英语',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.小初语法衔接、词汇',
                '2.听后选择&回答'
              ]
            },
            {
              name: 'LV2 60-80分',
              txt: [
                '1.语法训练，词汇',
                '2.听力口语技巧训练',
                '3.分级阅读、阅读题型讲解、完形解题巩固',
                '4.写作梳理'
              ]
            },
            {
              name: 'LV3 80-100分',
              txt: [
                '1.所学语法梳理、词汇',
                '2.听力口语技巧',
                '3.分级阅读、阅读综合讲解、完形专题',
                '4.写作专项'
              ]
            },
            {
              name: 'LV4 100-120分',
              txt: [
                '1.重点语法训练、词汇',
                '2.听力口语训练',
                '3.分级阅读、阅读能力训练、完形巩固训练',
                '4.写作能力训练'
              ]
            }
          ]
        },
        {
          name: '物理',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.物态变化',
                '2.机械运动/声现象'
              ]
            },
            {
              name: 'LV2 60-72分',
              txt: [
                '1.能有目的地观察',
                '2.质量和密度',
                '3.光现象、透镜'
              ]
            },
            {
              name: 'LV3 72-90分',
              txt: [
                '1.能根据现象及数据，进行简单归类、分析及比较',
                '2.力、运动和力',
                '3.压强、液体压强'
              ]
            },
            {
              name: 'LV4 90-110分',
              txt: [
                '1.能运用物理知识解释现象',
                '2.浮力',
                '3.简单机械和功'
              ]
            },
            {
              name: 'LV5 110-120分',
              txt: [
                '1.能根据日常现象及实验，提出可探究科学问题',
                '2.能对现象的结果进行推测和假设',
                '3.会根据实验目的和已有条件，选择器材，设计实验',
                '4.期中期末专题'
              ]
            }
          ]
        },
        {
          name: '生物',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.生物与环境',
                '2.生物体的结构层次',
                '3.生物圈中的绿色植物'
              ]
            },
            {
              name: 'LV2 60-80分',
              txt: [
                '1.光合作用和呼吸作用',
                '2.开花和结果的过程',
                '3.人体的营养'
              ]
            },
            {
              name: 'LV3 80-100分',
              txt: [
                '1.生物圈中的人',
                '2.人体的综合',
                '3.动物的运动和行为'
              ]
            },
            {
              name: 'LV4 100-120分',
              txt: [
                '1.生物的遗传和变异',
                '2.生物的多样性',
                '3.生物技术、传染病和免疫'
              ]
            }
          ]
        }
      ]
    },
    {
      name: '初三',
      subject: [
        {
          name: '数学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.能根据需要进行估算',
                '2.掌握反比例函数、二次函数、旋转'
              ]
            },
            {
              name: 'LV2 60-72分',
              txt: [
                '熟练掌握锐角三角函数、投影与视图、统计与概率'
              ]
            },
            {
              name: 'LV3 72-90分',
              txt: [
                '1.圆',
                '2.相似',
                '3.几何专项问题',
                '4.探究与开放性问题'
              ]
            },
            {
              name: 'LV4 90-110分',
              txt: [
                '1.核心题型归纳',
                '2.函数类综合问题',
                '3.基础回归'
              ]
            },
            {
              name: 'LV5 110-120分',
              txt: [
                '1.23专题课',
                '2.24专题课',
                '3.25专题课',
                '4.题型点拨'
              ]
            }
          ]
        },
        {
          name: '语文',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.默写名句名篇',
                '2.识记字音字形'
              ]
            },
            {
              name: 'LV2 60-72分',
              txt: [
                '1.理解重要词、句、概念的含义',
                '2.理解句式和用法，翻译句子',
                '3.优秀作文写作方法、作文修改'
              ]
            },
            {
              name: 'LV3 72-90分',
              txt: [
                '1.筛选整合信息，归纳主题思想',
                '2.分析文章结构，作者情感态度、观点看法',
                '3.体会文体特征、表现手法、语言特色',
                '4.重点作家作品文学常识'
              ]
            },
            {
              name: 'LV4 90-110分',
              txt: [
                '1.体会语句丰富含义，品味语言',
                '2.现代文阅读综合、文言文对比阅读综合、课内文言文基础',
                '3.作文审题和立意强化、作文修改',
                '4.正确使用词语和句子',
                '5.基础知识综合演练'
              ]
            },
            {
              name: 'LV5 110-120分',
              txt: [
                '1.现代文阅读题型拓展、中考名著题型总结',
                '2.作文素材迁移运用、作文修改升格',
                '3.多角度发掘作品主题及内涵',
                '4.探讨作者写作意图，探究问题并提出',
                '5.新题型、易错题汇总、基础回顾',
                '6.一模二模阅读题型梳理',
                '7.作文迁移与修改'
              ]
            }
          ]
        },
        {
          name: '英语',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.初中语法、词汇梳理',
                '2.听力题型分析及解题方法讲解'
              ]
            },
            {
              name: 'LV2 60-80分',
              txt: [
                '1.重点语法训练、初中词汇积累',
                '2.听力与口语专项',
                '3.完形、阅读解题训练'
              ]
            },
            {
              name: 'LV3 80-100分',
              txt: [
                '1.语法综合复习、初中词汇训练',
                '2.听力与口语训练',
                '3.完形、阅读题材专项训练',
                '4.写作综合训练'
              ]
            },
            {
              name: 'LV4 100-120分',
              txt: [
                '1.语法、中考词汇训练',
                '2.听力与口语训练',
                '3.中考完形、阅读经典题目分析',
                '4.写作综合训练'
              ]
            }
          ]
        },
        {
          name: '物理',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.内能、电流和电路',
                '2.电压和电阻'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.电与磁',
                '2.电功率、欧姆定律'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.能找出现象的共同特征，总结得出概念和规律',
                '2.运动和力、简单机械'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.能运用观察、实验手段解决问题',
                '2.能运用数学解决有关物理问题',
                '3.压强和浮力、全面复习、电学综合'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.会正确记录实验数据',
                '2.会根据现象及实验事实归纳得出科学规律',
                '3.能评估实验结果，并提出改进方案',
                '4.力学综合、实验专题、中考演练'
              ]
            }
          ]
        },
        {
          name: '化学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.初识微观粒子',
                '2.初识空气、氧气、水',
                '3.走进化学世界'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.实验专题/碳、金属及其化合物',
                '2.微粒观念与化学用语',
                '3.身边的基本化学物质'
              ]
            },
            {
              name: 'LV3 70-90分',
              txt: [
                '1.能够运用所学化学知识、变化和联系的观点分析',
                '2.工艺流程专题练习',
                '3.酸碱盐、溶液'
              ]
            },
            {
              name: 'LV4 90-100分',
              txt: [
                '1.能认识科学探究的意义和基本过程',
                '2.探究实验专题、性质实验专题'
              ]
            }
          ]
        },
        {
          name: '生物',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.生物与环境专题',
                '2.生命系统专题'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.能表达生物学相关内容，解释、分析生命现象',
                '2.植物专题',
                '3.人体专题'
              ]
            },
            {
              name: 'LV3 70-90分',
              txt: [
                '1.能对实验现象和结果进行解释、分析',
                '2.能对简单的生物学问题进行初步探究',
                '3.动物专题、生殖和遗传专题',
                '4.生物进化专题、健康生活和生物技术专题'
              ]
            },
            {
              name: 'LV4 90-100分',
              txt: [
                '1.能对生物学问题提出合理的解决方案',
                '2.科普阅读专题',
                '3.实验与探究专题',
                '4.生命现象分析专题、考前指导专题'
              ]
            }
          ]
        }
      ]
    },
    {
      name: '高一\\高二',
      subject: [
        {
          name: '数学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.函数概念/集合概念',
                '2.二次函数/三角恒等变换'
              ]
            },
            {
              name: 'LV2 60-90分',
              txt: [
                '1.统计初步/算法初步',
                '2.不等式初步/集合',
                '3.数列初步/函数',
                '4.解三角形'
              ]
            },
            {
              name: 'LV3 90-110分',
              txt: [
                '1.逻辑用语',
                '2.空间向量与立体几何',
                '3.圆锥曲线与方程',
                '4.常用逻辑用语',
                '5.解析几何初步'
              ]
            },
            {
              name: 'LV4 110-130分',
              txt: [
                '1.立体几何初步',
                '2.导数',
                '3.推理证明',
                '4.复数',
                '5.坐标系与参数方程'
              ]
            },
            {
              name: 'LV5 130-150分',
              txt: [
                '1.离散随机变量与分布列',
                '2.计数原理/复数',
                '3.推理与证明',
                '4.导数初步'
              ]
            }
          ]
        },
        {
          name: '语文',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.记叙文主题拔高',
                '2.高中文言文基础语法 '
              ]
            },
            {
              name: 'LV2 60-90分',
              txt: [
                '1.记叙文审题立意选材',
                '2.小说知识积累',
                '3.文言文断句，翻译'
              ]
            },
            {
              name: 'LV3 90-110分',
              txt: [
                '1.记叙文仿写议论文审题',
                '2.古诗文背默/文学积累',
                '3.散文/非连续信息提取/古诗鉴赏',
                '4.材料作文的审题方法',
                '5.议论文结构论证方法'
              ]
            },
            {
              name: 'LV4 110-130分',
              txt: [
                '1.散文题型梳理',
                '2.实用类文本题型突击/古诗的解读及题型',
                '3.文言文主观题分析',
                '4.议论文的审题立意/结构优化',
                '5.作文素材运用，评论类写作',
                '6.散文概括题、含义题、作用题、赏析题重点探究'
              ]
            },
            {
              name: 'LV5 130-150分',
              txt: [
                '1.材料作文的审题立意/时评类作文',
                '2.议论文论证分析/结构设置/立意深化',
                '3.小说赏读及题型探究',
                '4.文化类、反思类、哲理类散文解读',
                '5.先秦诸子散文诗歌艺术手法与鉴赏',
                '6.造字法、谦敬辞、传统文化等知识积累'
              ]
            }
          ]
        },
        {
          name: '英语',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.学习高中基本语法及高中词汇',
                '2.初级听力对话/完成句子'
              ]
            },
            {
              name: 'LV2 60-90分',
              txt: [
                '1.语法专题强化词汇巩固',
                '2.初级听力长对话，及独白大意',
                '3.汉译英翻译'
              ]
            },
            {
              name: 'LV3 90-110分',
              txt: [
                '1.提取关键信息，并记录',
                '2.初级阅读相关话题的文本阅读，提升解题能力',
                '3.适当运用多种句式',
                '4.语法迁移阅读词汇记忆',
                '5.中级听力对话'
              ]
            },
            {
              name: 'LV4 110-130分',
              txt: [
                '1.中级阅读总结文本的结构和主旨大意',
                '2.较难的汉译英',
                '3.语法体系进一步完善词汇搭配',
                '4.中级听力独白',
                '5.综合阅读训练'
              ]
            },
            {
              name: 'LV5 130-150分',
              txt: [
                '1.提纲写作',
                '2.重点语法讲解一词多义',
                '3.中级听力长对话及独白大意',
                '4.强化主旨大意题和作者情感类题型的解题能力',
                '5.写作方法训练'
              ]
            }
          ]
        },
        {
          name: '物理',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.相互作用/直线运动',
                '2.牛顿运动定律及应用'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.静电场/功和功率',
                '2.动能和动能定理/电场力',
                '3.势能/机械能及其守恒'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.电场应用/恒定电流/电学实验',
                '2.动量/曲线运动/万有引力',
                '3.动量冲量/定理/守恒定律',
                '4.圆周运动及应用/开普勒三大定律'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.地磁场/安培力',
                '2.洛伦兹力/磁场',
                '3.楞次定律法拉第电磁感应定律',
                '4.交变电流',
                '5.万有引力定律及应用',
                '6.三种卫星/宇宙航行',
                '7.匀变速直线运动的应用'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.交变电流变压器及远距离输电',
                '2.热力学定律分子动理论',
                '3.机械振动',
                '4.电磁波/机械波',
                '5.几何光学/物理光学',
                '6.波粒二象性/原子核/原子结构'
              ]
            }
          ]
        },
        {
          name: '化学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.物质分类',
                '2.离子反应/氧化还原反应'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.元素化合物综合',
                '2.元素周期表与周期律',
                '3.选修三物质结构'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.有机化合物',
                '2.自然资源开发与利用',
                '3.化学与生活',
                '4.认识有机化合物',
                '5.脂肪烃/芳香烃/卤代烃',
                '6.金属元素及化合物'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.化学反应与能量',
                '2.化学反应速率与限度',
                '3.烃和卤代烃',
                '4.化学反应与能量',
                '5.非金属元素及化合物'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.烃的含氧衍生物',
                '2.生命中的基础有机化学物质',
                '3.合成高分子',
                '4.化学反应与能量',
                '5.化学反应速率',
                '6.化学平衡/四大平衡综合',
                '7.水溶液中的离子平衡'
              ]
            }
          ]
        },
        {
          name: '生物',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.组成细胞的元素',
                '2.组成细胞的化合物'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.组成细胞的分子',
                '2.细胞的物质输入与输出',
                '3.细胞的能量供应和利用'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.基因的本质与表达',
                '2.基因突变及其他变异',
                '3.从杂交育种到基因工程',
                '4.现代生物进化理论',
                '5.人体的内环境与稳定'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.动物的神经调节',
                '2.动物的体液调节',
                '3.动物的免疫调节',
                '4.动物和人体生命活动的调节',
                '5.植物的激素调节'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.种群和群落',
                '2.生态系统及其稳定性',
                '3.生态环境的保护',
                '4.生物技术实践',
                '5.现代生物科技专题'
              ]
            }
          ]
        },
        {
          name: '地理',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.地理概况',
                '2.地球与地球仪'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.农业区位/人口',
                '2.工业区位/城市',
                '3.中国人文地理'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.中国自然地理',
                '2.中国的区域',
                '3.区域地理',
                '4.世界自然地理'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.世界地形',
                '2.世界的气候',
                '3.世界重要分区',
                '4.地理信息系统'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.旅游地理',
                '2.自然灾害',
                '3.综合题解题能力'
              ]
            }
          ]
        },
        {
          name: '历史',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.古代中国政治基本史实',
                '2.高中历史学习要求'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.从史料中提取有效信息',
                '2.古代中国经济发展基本史实',
                '3.历史时期内政治和经济发展的内在联动'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.对经济发展进行对比归纳',
                '2.掌握历史大题思路和方法',
                '3.了解古代中国思想文化发展',
                '4.古代中国儒家思想演变历程',
                '5.理解传统儒家思想现实意义'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.掌握文化发展史的基础知识',
                '2.理解近代西方思想文化对中国近代化的推动作用',
                '3.掌握文化发展史部分材料大题的基本解题能力',
                '4.梳理选修部分历史基础知识',
                '5.理解选修模块跟必修模块的历史关系'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.将选修模块的历史知识融入中学历史大框架中',
                '2.梳理常见选择题重点题型',
                '3.掌握从图表、古文材料中提取信息的能力',
                '4.从材料类型和设问逻辑两方面掌握选择题解决方法'
              ]
            }
          ]
        },
        {
          name: '政治',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.社会主义从理论到实践',
                '2.经济与社会'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.经济发展与社会进步',
                '2.中国共产党',
                '3.人民当家作主'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.我国政治制度',
                '2.法治建设',
                '3.哲学的作用',
                '4.探索世界与追求真理',
                '5.中国特色社会主义'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.认识社会与价值选择',
                '2.文化传承与文化创新',
                '3.文化的作用',
                '4.文化创新',
                '5.依法治国'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.国家',
                '2.政治多极化',
                '3.当代国际政治与经济',
                '4.法律与生活',
                '5.逻辑与思维',
                '6.经济运行与宏观调控'
              ]
            }
          ]
        }
      ]
    },
    {
      name: '高三',
      subject: [
        {
          name: '数学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.三角恒等变换',
                '2.三角函数图像/解三角形'
              ]
            },
            {
              name: 'LV2 60-90分',
              txt: [
                '1.平面向量综合',
                '2.集合与逻辑',
                '3.立体几何综合'
              ]
            },
            {
              name: 'LV3 90-110分',
              txt: [
                '1.直线与圆/圆锥曲线综合',
                '2.三角函数/函数与导数综合',
                '3.数列与不等式',
                '4.平面向量'
              ]
            },
            {
              name: 'LV4 110-130分',
              txt: [
                '1.圆锥曲线综合/应用',
                '2.概率统计综合/应用',
                '3.压轴题分类选讲',
                '4.前七选择题专题训练',
                '5.离散随机变量',
                '6.函数与导数综合/应用',
                '7.统计与概率'
              ]
            },
            {
              name: 'LV5 130-150分',
              txt: [
                '1.三道基本大题专题训练',
                '2.前五填空题专题训练',
                '3.8与14题专题训练',
                '4.18-19题方法汇总',
                '5.创新性题目分类总结',
                '6.试题训练',
                '7.模拟训练',
              ]
            }
          ]
        },
        {
          name: '语文',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.高中基础知识/文化常识梳理',
                '2.名著基础知识积累'
              ]
            },
            {
              name: 'LV2 60-90分',
              txt: [
                '1.议论文审题立意升格名著类微写作',
                '2.重点作家作品文学常识名著名篇解读',
                '3.散文常见题型巩固训练'
              ]
            },
            {
              name: 'LV3 90-110分',
              txt: [
                '1.议论文论证过程',
                '2.议论文的素材运用',
                '3.议论文的语言训练',
                '4.想象类记叙文写作',
                '5.评论类、描写类微写作',
                '6.基础知识综合演练'
              ]
            },
            {
              name: 'LV4 110-130分',
              txt: [
                '1.高考散文主题/拓展延伸题/仿写与升华',
                '2.议论文立意拔高/结构优化',
                '3.语言/文学/文化常识积累与运用',
                '4.艺术手法概念阐释',
                '5.名篇背诵与默写',
                '6.名著学习及知识积累'
              ]
            },
            {
              name: 'LV5 130-150分',
              txt: [
                '1.作文热门话题分析/修改与优化',
                '2.微写作综合统练',
                '3.历年经典散文赏读',
                '4.文学类文本题型训练',
                '5.非连续性文本综合训练',
                '6.文言文知识梳理及重难点题型统练',
                '7.古诗知识梳理及题型统练'
              ]
            }
          ]
        },
        {
          name: '英语',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.语法回归基础',
                '2.准确记录关键信息'
              ]
            },
            {
              name: 'LV2 60-90分',
              txt: [
                '1.高考语法考点梳理高考词汇梳理',
                '2.高级听力及独白',
                '3.高考完形和阅读梳理'
              ]
            },
            {
              name: 'LV3 90-110分',
              txt: [
                '1.重点语法模块训练及词汇应用理解',
                '2.高级听力长对话及独白大意',
                '3.高考完形、阅读、七选五解题方法讲解',
                '4.各类应用文专题讲解'
              ]
            },
            {
              name: 'LV4 110-130分',
              txt: [
                '1.语法写作迁移练习熟词僻义积累',
                '2.提取信息，并能把握大意',
                '3.阅读、七选五重点题型训练及作文迁移',
                '4.情景作文专题训练'
              ]
            },
            {
              name: 'LV5 130-150分',
              txt: [
                '1.语法练习/写作迁移词汇综合训练',
                '2.能进行口头翻译或口头作文',
                '3.完形、阅读经典题目分析',
                '4.优化应用文及情景作文语言及结构'
              ]
            }
          ]
        },
        {
          name: '物理',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.受力分析综合/牛顿运动定律综合',
                '2.直线与曲线运动综合'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.机械能守恒定律综合',
                '2.抛体运动综合',
                '3.圆周运动综合'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.带电粒子在电场中的运动综合',
                '2.动量定理综合',
                '3.动量守恒定理综合',
                '4.机械振动机械波综合',
                '5.电场力/电场能综合',
                '6.万有引力定律综合'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.电磁感应综合/交流电综合',
                '2.光热选择题训练',
                '3.焦耳定律综合',
                '4.安培力综合',
                '5.洛伦兹力综合/六大新科技',
                '6.闭合电路欧姆定律综合',
                '7.带电粒子在复合场中的运动综合',
                '8.功与功率综合/动能定理综合'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.实验题训练',
                '2.基础选择题训练',
                '3.电学实验/力学实验',
                '4.选择题训练',
                '5.基础大题训练',
                '6.重难点大题训练',
                '7.考前点拨/查漏补缺',
                '8.回归课本/常考模型/解题技巧'
              ]
            }
          ]
        },
        {
          name: '化学',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.化学用语与基本概念',
                '2.两大反应复习'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.有机合成与推断复习',
                '2.金属元素性质复习',
                '3.非金属元素性质复习'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.综合实验复习',
                '2.元素化合物与周期律',
                '3.有机反应与实验复习',
                '4.水溶液离子平衡复习',
                '5.电化学复习',
                '6.课本实验专题复习',
                '7.能量与速率复习'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.化学反应原理专题',
                '2.综合实验探究专题',
                '3.压轴选择题专练',
                '4.元素化合物专题',
                '5.五大工艺流程专题',
                '6.有机官能团转化专题',
                '7.新信息专题',
                '8.化学平衡综合复习'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.实验探究专练',
                '2.有机推断专练',
                '3.反应原理专练',
                '4.工业流程专练',
                '5.高频易错专练',
                '6.考前强化',
                '7.试题训练',
                '8.回归基础'
              ]
            }
          ]
        },
        {
          name: '生物',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.无机物/有机物',
                '2.细胞的结构与功能'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.基因遗传规律',
                '5.细胞周期和有丝分裂',
                '6.减数分裂和受精作用'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.基因工程/细胞工程',
                '2.生物技术与实践',
                '3.伴性遗传和人类遗传病',
                '4.遗传的分子基础',
                '5.变异与育种/生物进化',
                '6.植物激素调节/动物生命调节',
                '7.种群、群落、生态系统'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.专项模块：代谢专题',
                '2.专项模块：遗传与变异专题',
                '3.专项模块：信息传递专题',
                '4.专项模块：稳态与环境专题',
                '5.专项模块：教材基础实验',
                '6.专项模块：实验操作与设计专题',
                '7.专项模块：物质专题',
                '8.专项模块：细胞专题'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.题型训练：图表题',
                '2.题型训练：实验题/遗传推导题',
                '3.专项模块：信息热点与前沿科技',
                '4.题型训练：概念题/信息获取题',
                '5.考前训练：复习指导',
                '6.考前训练：模块点拨',
                '7.考前训练：基础回归',
                '8.考前训练：攻坚重难点'
              ]
            }
          ]
        },
        {
          name: '地理',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.人文地理',
                '2.自然地理'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.中国自然地理专题',
                '2.中国人文地理专题',
                '3.地理信息系统'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.地理答题方式与语言',
                '2.材料题专项训练',
                '3.读图专项训练',
                '4.地球和地球仪'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.综合题专项训练',
                '2.选择题专项训练',
                '3.人文地理专题',
                '4.自然地理专题'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.世界区域专题',
                '2.中国区域专题',
                '3.知识点规律研究',
                '4.地理热点分析'
              ]
            }
          ]
        },
        {
          name: '历史',
          data: [
            {
              name: 'Lv1 0-60分',
              txt: [
                '高中历史基础知识总体梳理'
              ]
            },
            {
              name: 'Lv2 60-70分',
              txt: [
                '掌握解答中国史部分综合材料大题的能力'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.按专题梳理中国史重点知识',
                '2.掌握解答综合材料主观题的能力',
                '3.按编年掌握世界历史各个时期的政治、经济、文化发展'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.按专题回顾高中历史重点知识',
                '2.培养学生的中国史基础知识迁移能力，以解决复杂题型',
                '3.深度理解中国历史的政治、经济、文化'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.材料大题题型回顾梳理',
                '2.常考热点归纳',
                '3.对标高考，掌握复杂材料大题的解题能力'
              ]
            }
          ]
        },
        {
          name: '政治',
          data: [
            {
              name: 'LV1 0-60分',
              txt: [
                '1.经济与社会',
                '2.中国特色社会主义',
                '3.科学社会主义'
              ]
            },
            {
              name: 'LV2 60-70分',
              txt: [
                '1.逻辑与思维',
                '2.法律与生活',
                '3.科学社会主义'
              ]
            },
            {
              name: 'LV3 70-80分',
              txt: [
                '1.哲学与文化',
                '2.政治与法治',
                '3.材料分析题专项',
                '4.国际政治与经济'
              ]
            },
            {
              name: 'LV4 80-90分',
              txt: [
                '1.选择题专项',
                '2.必修',
                '3.选择性必修'
              ]
            },
            {
              name: 'LV5 90-100分',
              txt: [
                '1.模块训练',
                '2.测试训练',
                '3.社会热点分析'
              ]
            }
          ]
        }
      ]
    }
  ]
  console.log(gradeInfoCodeMap);




// WEBPACK FOOTER //
// ./src/service/FToFData.js